from enum import Enum


class ShearerDir(Enum):
    """煤机方向枚举"""

    Stop = 0  # 停止
    Down = 1  # 下行
    Up = 2  # 上行


class SensorTypeID(Enum):
    """传感器类型ID枚举"""

    前柱压力 = 0
    后柱压力 = 1
    前溜行程 = 2
    后溜行程 = 3
    尾梁行程 = 4
    插板行程 = 5
    一级护帮行程 = 6
    红外 = 7
    顶梁X = 8
    顶梁Y = 9
    高度 = 10
    倾角2X = 11
    倾角3X = 12
    倾角4X = 13
    三级护帮接近开关 = 14
    遥控接收器状态 = 15
    氮气传感 = 16
    一级护帮压力 = 17
    平衡上腔 = 18
    平衡下腔 = 19
    顶梁前端 = 20
    斜拉压力 = 21
    一级护帮接近开关 = 22
    找直状态报送 = 23
    管道压力 = 24
    人员定位 = 25
    左柱压力 = 26
    右柱压力 = 27
    中柱压力 = 28
    拉绳传感器 = 29
    整机电流 = 30
    模拟电流 = 31
    数字电流 = 32
    电磁阀电流 = 33
    模拟电压 = 34
    电磁阀电压 = 35
    闭锁电压 = 36
    急停电压 = 37
    UWB人员定位 = 38
    毫米波雷达 = 39
    高度姿态X = 40
    高度姿态Y = 41
    高度姿态Z = 42
    高度压力1 = 43
    高度压力2 = 44
    激光测距 = 45
    伸缩梁行程 = 46
    摄像头状态三 = 47
    含矾率 = 48
    应用加载模式 = 49
    角度1X = 50
    角度1Y = 51
    角度2X = 52
    角度2Y = 53
    角度3X = 54
    角度3Y = 55
    角度4X = 56
    角度4Y = 57
    备用1 = 101
    备用2 = 102
    备用3 = 103
    备用4 = 104
    备用5 = 105
    备用6 = 106
    备用7 = 107
    备用8 = 108
    备用9 = 109
    无效传感 = 0xFFFF


class SensorTypeMode(Enum):
    """传感器类型模式枚举"""

    模拟量 = 0
    开关量 = 1
    倾角量 = 2
    人员感知卡 = 3
    应用加载模式 = 4


class ActionType(Enum):
    """动作类型枚举"""

    无动作 = 0
    单动动作 = 1
    单架自动 = 6
    成组动作 = 2
    跟机动作 = 3
    点动动作 = 4
    自动补压 = 5
    其它动作 = 7
    自动动作执行状态 = 64
    自动动作调度信息 = 65


class AutoActionCode(Enum):
    """自动动作编码枚举"""

    无动作 = 0
    MOMVE_PUSH_FAST = 6  # 成组快速ASQ
    FOLLOW_PUSH_FAST = 9  # 跟机快速ASQ
    FOLLOW_PUSH_SEQUENCE = 11  # 跟机顺序ASQ
    FOLLOW_PUSH_SEQ_FAST = 12  # 跟机顺序快速ASQ


class ActionInfoType(Enum):
    """动作信息类型枚举"""

    单动缺省 = 0
    主机远控单动 = 1
    就地单动 = 2
    主机远控成组 = 17
    就地成组 = 18
    主机下发跟机 = 33
    自动跟机 = 34
    成组动作码 = 48
    跟机动作码 = 64
    点动动作码 = 80
    补压动作码 = 81
    单架自动动作码 = 96


class RemoteControlTypeEnum(Enum):
    """远程控制类型枚举"""

    NoneA = 0  # 无动作类别
    Local = 1  # 工人按键盘控制的动作
    Host = 2  # 主机上远控操作动作
    Auto = 3  # 跟机自动化的动作
